//Strings for delete confirmation dialog

//Title
"Are you sure you want to delete the selected recipient(s)?" = "¿Está seguro de que desea eliminar los destinatarios seleccionados?";

//Buttons
"Delete" = "Eliminar";
"Cancel" = "Cancelar";